ebay/ebay-connector/ebay-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/ebay/api_setPromotionalSale_mandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ebl="urn:ebay:apis:eBLBaseComponents">
	<soapenv:Header>
		<ebl:RequesterCredentials>
			<ebl:eBayAuthToken>%s(authToken)</ebl:eBayAuthToken>
		</ebl:RequesterCredentials>
	</soapenv:Header>
	<soapenv:Body>
		<ebl:GetPromotionalSaleDetailsRequest>
			<ebl:Version>%s(version)</ebl:Version>
		</ebl:GetPromotionalSaleDetailsRequest>
	</soapenv:Body>
</soapenv:Envelope>